renesas/fsp/ra/fsp/src/bsp/cmsis/Device/RENESAS/Include/R7FA8E2AF.h
        struct
        {
            __IOM uint32_t CAEN     : 1; /*!< [0..0] Automatic Calibration Enable                                       */
            __IOM uint32_t CANOWR   : 1; /*!< [1..1] Calibration no write mode                                          */
            uint32_t                : 6;
            __IOM uint32_t CAITV    : 5; /*!< [12..8] Calibration interval                                              */
            uint32_t                : 3;
            __IOM uint32_t CASFTSTA : 5; /*!< [20..16] Calibration DS shift start value                                 */
            uint32_t                : 3;
            __IOM uint32_t CASFTEND : 5; /*!< [28..24] Calibration DS shift end value                                   */
            uint32_t                : 3;
        } CCCTL0_b;
    };

    union
    {
        __IOM uint32_t CCCTL1;             /*!< (@ 0x00000004) xSPI Command Calibration Control register 1                */

        struct
        {
            __IOM uint32_t CACMDSIZE  : 2; /*!< [1..0] Command Size                                                       */
            __IOM uint32_t CAADDSIZE  : 3; /*!< [4..2] Address size                                                       */
            __IOM uint32_t CADATASIZE : 4; /*!< [8..5] Write/Read Data Size                                               */
            uint32_t                  : 7;
            __IOM uint32_t CAWRLATE   : 5; /*!< [20..16] Write Latency cycle                                              */
            uint32_t                  : 3;
            __IOM uint32_t CARDLATE   : 5; /*!< [28..24] Read Latency cycle                                               */
            uint32_t                  : 3;
        } CCCTL1_b;
    };

    union
    {
        __IOM uint32_t CCCTL2;           /*!< (@ 0x00000008) xSPI Command Calibration Control register 2                */

        struct
        {
            __IOM uint32_t CAWRCMD : 16; /*!< [15..0] Calibration pattern write command                                 */
            __IOM uint32_t CARDCMD : 16; /*!< [31..16] Calibration pattern read command                                 */
        } CCCTL2_b;
    };

    union
    {
        __IOM uint32_t CCCTL3;         /*!< (@ 0x0000000C) xSPI Command Calibration Control register 3                */

        struct
        {
            __IOM uint32_t CAADD : 32; /*!< [31..0] Calibration pattern address                                       */
        } CCCTL3_b;
    };

    union
    {
        __IOM uint32_t CCCTL4;          /*!< (@ 0x00000010) xSPI Command Calibration Control register 4                */

        struct
        {
            __IOM uint32_t CADATA : 32; /*!< [31..0] Calibration pattern data                                          */
        } CCCTL4_b;
    };

    union
    {
        __IOM uint32_t CCCTL5;          /*!< (@ 0x00000014) xSPI Command Calibration Control register 5                */

        struct
        {
            __IOM uint32_t CADATA : 32; /*!< [31..0] Calibration pattern data                                          */
        } CCCTL5_b;
    };

    union
    {
        __IOM uint32_t CCCTL6;          /*!< (@ 0x00000018) xSPI Command Calibration Control register 6                */

        struct
        {
            __IOM uint32_t CADATA : 32; /*!< [31..0] Calibration pattern data                                          */
        } CCCTL6_b;
    };

    union
    {
        __IOM uint32_t CCCTL7;          /*!< (@ 0x0000001C) xSPI Command Calibration Control register 7                */

        struct
        {
            __IOM uint32_t CADATA : 32; /*!< [31..0] Calibration pattern data                                          */
        } CCCTL7_b;
    };
} R_XSPI0_CCCTLCS_Type;                 /*!< Size = 32 (0x20)                                                          */

/**
 * @brief R_AGTX0_AGT16_CTRL [CTRL] (CTRL)
 */
typedef struct
{
    union
    {
        __IOM uint8_t AGTCR;           /*!< (@ 0x00000000) AGT Control Register                                       */

        struct
        {
            __IOM uint8_t TSTART : 1;  /*!< [0..0] AGT count start                                                    */
            __IM uint8_t  TCSTF  : 1;  /*!< [1..1] AGT count status flag                                              */
            __OM uint8_t  TSTOP  : 1;  /*!< [2..2] AGT count forced stop                                              */
            uint8_t              : 1;
            __IOM uint8_t TEDGF  : 1;  /*!< [4..4] Active edge judgment flag                                          */
            __IOM uint8_t TUNDF  : 1;  /*!< [5..5] Underflow flag                                                     */
            __IOM uint8_t TCMAF  : 1;  /*!< [6..6] Compare match A flag                                               */
            __IOM uint8_t TCMBF  : 1;  /*!< [7..7] Compare match B flag                                               */
        } AGTCR_b;
    };

    union
    {
        __IOM uint8_t AGTMR1;          /*!< (@ 0x00000001) AGT Mode Register 1                                        */

        struct
        {
            __IOM uint8_t TMOD   : 3;  /*!< [2..0] Operating mode                                                     */
            __IOM uint8_t TEDGPL : 1;  /*!< [3..3] Edge polarity                                                      */
            __IOM uint8_t TCK    : 3;  /*!< [6..4] Count source                                                       */
            uint8_t              : 1;
        } AGTMR1_b;
    };

    union
    {
        __IOM uint8_t AGTMR2;          /*!< (@ 0x00000002) AGT Mode Register 2                                        */

        struct
        {
            __IOM uint8_t CKS : 3;     /*!< [2..0] AGTLCLK/AGTSCLK count source clock frequency division
                                        *   ratio                                                                     */
            uint8_t           : 4;
            __IOM uint8_t LPM : 1;     /*!< [7..7] Low Power Mode                                                     */
        } AGTMR2_b;
    };

    union
    {
        __IOM uint8_t AGTIOSEL_ALT;    /*!< (@ 0x00000003) AGT Pin Select Register                                    */

        struct
        {
            __IOM uint8_t SEL  : 2;    /*!< [1..0] AGTIO pin select                                                   */
            uint8_t            : 2;
            __IOM uint8_t TIES : 1;    /*!< [4..4] AGTIO input enable                                                 */
            uint8_t            : 3;
        } AGTIOSEL_ALT_b;
    };

    union
    {
        __IOM uint8_t AGTIOC;          /*!< (@ 0x00000004) AGT I/O Control Register                                   */

        struct
        {
            __IOM uint8_t TEDGSEL : 1; /*!< [0..0] I/O polarity switchFunction varies depending on the operating
                                        *   mode.                                                                     */
            uint8_t             : 1;
            __IOM uint8_t TOE   : 1;   /*!< [2..2] AGTOn output enable                                                */
            uint8_t             : 1;
            __IOM uint8_t TIPF  : 2;   /*!< [5..4] Input filter                                                       */
            __IOM uint8_t TIOGT : 2;   /*!< [7..6] Count control                                                      */
        } AGTIOC_b;
    };

    union
    {
        __IOM uint8_t AGTISR;          /*!< (@ 0x00000005) AGT Event Pin Select Register                              */

        struct
        {
            uint8_t            : 2;
            __IOM uint8_t EEPS : 1;    /*!< [2..2] AGTEE polarty selection                                            */
            uint8_t            : 5;
        } AGTISR_b;
    };

    union
    {
        __IOM uint8_t AGTCMSR;         /*!< (@ 0x00000006) AGT Compare Match Function Select Register                 */

        struct
        {
            __IOM uint8_t TCMEA  : 1;  /*!< [0..0] Compare match A register enable                                    */
            __IOM uint8_t TOEA   : 1;  /*!< [1..1] AGTOA output enable                                                */
            __IOM uint8_t TOPOLA : 1;  /*!< [2..2] AGTOA polarity select                                              */
            uint8_t              : 1;
            __IOM uint8_t TCMEB  : 1;  /*!< [4..4] Compare match B register enable                                    */
            __IOM uint8_t TOEB   : 1;  /*!< [5..5] AGTOB output enable                                                */
            __IOM uint8_t TOPOLB : 1;  /*!< [6..6] AGTOB polarity select                                              */
            uint8_t              : 1;
        } AGTCMSR_b;
    };

    union
    {
        __IOM uint8_t AGTIOSEL;        /*!< (@ 0x00000007) AGT Pin Select Register                                    */

        struct
        {
            __IOM uint8_t SEL  : 2;    /*!< [1..0] AGTIO pin select                                                   */
            uint8_t            : 2;
            __IOM uint8_t TIES : 1;    /*!< [4..4] AGTIO input enable                                                 */
            uint8_t            : 3;
        } AGTIOSEL_b;
    };
} R_AGTX0_AGT16_CTRL_Type;             /*!< Size = 8 (0x8)                                                            */

/**
 * @brief R_AGTX0_AGT16 [AGT16] (AGT (16-bit) peripheral registers)
 */
typedef struct
{
    union
    {
        __IOM uint16_t AGT;            /*!< (@ 0x00000000) AGT Counter Register                                       */

        struct
        {
            __IOM uint16_t AGT : 16;   /*!< [15..0] 16bit counter and reload register. NOTE : When 1 is
                                        *   written to the TSTOP bit in the AGTCRn register, the 16-bit
                                        *   counter is forcibly stopped and set to FFFFH.                             */
        } AGT_b;
    };

    union
    {
        __IOM uint16_t AGTCMA;          /*!< (@ 0x00000002) AGT Compare Match A Register                               */

        struct
        {
            __IOM uint16_t AGTCMA : 16; /*!< [15..0] AGT Compare Match A data is stored.NOTE : When 1 is
                                         *   written to the TSTOP bit in the AGTCRn register, set to
                                         *   FFFFH                                                                     */
        } AGTCMA_b;
    };

    union
    {
        __IOM uint16_t AGTCMB;          /*!< (@ 0x00000004) AGT Compare Match B Register                               */

        struct
        {
            __IOM uint16_t AGTCMB : 16; /*!< [15..0] AGT Compare Match B data is stored.NOTE : When 1 is
                                         *   written to the TSTOP bit in the AGTCR register, set to
                                         *   FFFFH                                                                     */
        } AGTCMB_b;
    };
    __IM uint16_t                 RESERVED;
    __IOM R_AGTX0_AGT16_CTRL_Type CTRL; /*!< (@ 0x00000008) CTRL                                                       */
} R_AGTX0_AGT16_Type;                   /*!< Size = 16 (0x10)                                                          */

/**
 * @brief R_AGTX0_AGT32 [AGT32] (AGTW (32-bit) peripheral registers)
 */
typedef struct
{
    union
    {
        __IOM uint32_t AGT;            /*!< (@ 0x00000000) AGT 32-bit Counter Register                                */

        struct
        {
            __IOM uint32_t AGT : 32;   /*!< [31..0] 32bit counter and reload register. NOTE : When 1 is
                                        *   written to the TSTOP bit in the AGTCRn register, the 16-bit
                                        *   counter is forcibly stopped and set to FFFFH.                             */
        } AGT_b;
    };

    union
    {
        __IOM uint32_t AGTCMA;          /*!< (@ 0x00000004) AGT Compare Match A Register                               */

        struct
        {
            __IOM uint32_t AGTCMA : 32; /*!< [31..0] AGT Compare Match A data is stored.NOTE : When 1 is
                                         *   written to the TSTOP bit in the AGTCRn register, set to
                                         *   FFFFH                                                                     */
        } AGTCMA_b;
    };

    union
    {
        __IOM uint32_t AGTCMB;          /*!< (@ 0x00000008) AGT Compare Match B Register                               */

        struct
        {
            __IOM uint32_t AGTCMB : 32; /*!< [31..0] AGT Compare Match B data is stored.NOTE : When 1 is
                                         *   written to the TSTOP bit in the AGTCR register, set to
                                         *   FFFFH                                                                     */
        } AGTCMB_b;
    };
    __IOM R_AGTX0_AGT16_CTRL_Type CTRL; /*!< (@ 0x0000000C) CTRL                                                       */
} R_AGTX0_AGT32_Type;                   /*!< Size = 20 (0x14)                                                          */

/**
 * @brief R_OFS_DATAFLASH_CFGDLOCK_CFGD [CFGD] (Configuration Data [0..1] Lock Bits)
 */
typedef struct
{
    union
    {
        __IM uint32_t CFGD_L;          /*!< (@ 0x00000000) Configuration Data Lock Bits Lower Word                    */

        struct
        {
            __IM uint32_t CDLK0  : 1;  /*!< [0..0] Configuration Data Lock Bit                                        */
            __IM uint32_t CDLK1  : 1;  /*!< [1..1] Configuration Data Lock Bit                                        */
            __IM uint32_t CDLK2  : 1;  /*!< [2..2] Configuration Data Lock Bit                                        */
            __IM uint32_t CDLK3  : 1;  /*!< [3..3] Configuration Data Lock Bit                                        */
            __IM uint32_t CDLK4  : 1;  /*!< [4..4] Configuration Data Lock Bit                                        */
            __IM uint32_t CDLK5  : 1;  /*!< [5..5] Configuration Data Lock Bit                                        */
            __IM uint32_t CDLK6  : 1;  /*!< [6..6] Configuration Data Lock Bit                                        */
            __IM uint32_t CDLK7  : 1;  /*!< [7..7] Configuration Data Lock Bit                                        */
            __IM uint32_t CDLK8  : 1;  /*!< [8..8] Configuration Data Lock Bit                                        */
            __IM uint32_t CDLK9  : 1;  /*!< [9..9] Configuration Data Lock Bit                                        */
            __IM uint32_t CDLK10 : 1;  /*!< [10..10] Configuration Data Lock Bit                                      */
            __IM uint32_t CDLK11 : 1;  /*!< [11..11] Configuration Data Lock Bit                                      */
            __IM uint32_t CDLK12 : 1;  /*!< [12..12] Configuration Data Lock Bit                                      */
            __IM uint32_t CDLK13 : 1;  /*!< [13..13] Configuration Data Lock Bit                                      */
            __IM uint32_t CDLK14 : 1;  /*!< [14..14] Configuration Data Lock Bit                                      */
            __IM uint32_t CDLK15 : 1;  /*!< [15..15] Configuration Data Lock Bit                                      */
            __IM uint32_t CDLK16 : 1;  /*!< [16..16] Configuration Data Lock Bit                                      */
            __IM uint32_t CDLK17 : 1;  /*!< [17..17] Configuration Data Lock Bit                                      */
            __IM uint32_t CDLK18 : 1;  /*!< [18..18] Configuration Data Lock Bit                                      */
            __IM uint32_t CDLK19 : 1;  /*!< [19..19] Configuration Data Lock Bit                                      */
            __IM uint32_t CDLK20 : 1;  /*!< [20..20] Configuration Data Lock Bit                                      */
            __IM uint32_t CDLK21 : 1;  /*!< [21..21] Configuration Data Lock Bit                                      */
            __IM uint32_t CDLK22 : 1;  /*!< [22..22] Configuration Data Lock Bit                                      */
            __IM uint32_t CDLK23 : 1;  /*!< [23..23] Configuration Data Lock Bit                                      */
            __IM uint32_t CDLK24 : 1;  /*!< [24..24] Configuration Data Lock Bit                                      */
            __IM uint32_t CDLK25 : 1;  /*!< [25..25] Configuration Data Lock Bit                                      */
            __IM uint32_t CDLK26 : 1;  /*!< [26..26] Configuration Data Lock Bit                                      */
            __IM uint32_t CDLK27 : 1;  /*!< [27..27] Configuration Data Lock Bit                                      */
            __IM uint32_t CDLK28 : 1;  /*!< [28..28] Configuration Data Lock Bit                                      */
            __IM uint32_t CDLK29 : 1;  /*!< [29..29] Configuration Data Lock Bit                                      */
            __IM uint32_t CDLK30 : 1;  /*!< [30..30] Configuration Data Lock Bit                                      */
            __IM uint32_t CDLK31 : 1;  /*!< [31..31] Configuration Data Lock Bit                                      */
        } CFGD_L_b;
    };

    union
    {
        __IM uint32_t CFGD_H;          /*!< (@ 0x00000004) Configuration Data Lock Bits Higher Word                   */

        struct
        {
            __IM uint32_t CDLK32 : 1;  /*!< [0..0] Configuration Data Lock Bit                                        */
            __IM uint32_t CDLK33 : 1;  /*!< [1..1] Configuration Data Lock Bit                                        */
            __IM uint32_t CDLK34 : 1;  /*!< [2..2] Configuration Data Lock Bit                                        */
            __IM uint32_t CDLK35 : 1;  /*!< [3..3] Configuration Data Lock Bit                                        */
            __IM uint32_t CDLK36 : 1;  /*!< [4..4] Configuration Data Lock Bit                                        */
            __IM uint32_t CDLK37 : 1;  /*!< [5..5] Configuration Data Lock Bit                                        */
            __IM uint32_t CDLK38 : 1;  /*!< [6..6] Configuration Data Lock Bit                                        */
            __IM uint32_t CDLK39 : 1;  /*!< [7..7] Configuration Data Lock Bit                                        */
            __IM uint32_t CDLK40 : 1;  /*!< [8..8] Configuration Data Lock Bit                                        */
            __IM uint32_t CDLK41 : 1;  /*!< [9..9] Configuration Data Lock Bit                                        */
            __IM uint32_t CDLK42 : 1;  /*!< [10..10] Configuration Data Lock Bit                                      */
            __IM uint32_t CDLK43 : 1;  /*!< [11..11] Configuration Data Lock Bit                                      */
            __IM uint32_t CDLK44 : 1;  /*!< [12..12] Configuration Data Lock Bit                                      */
            __IM uint32_t CDLK45 : 1;  /*!< [13..13] Configuration Data Lock Bit                                      */
            __IM uint32_t CDLK46 : 1;  /*!< [14..14] Configuration Data Lock Bit                                      */
            __IM uint32_t CDLK47 : 1;  /*!< [15..15] Configuration Data Lock Bit                                      */
            __IM uint32_t CDLK48 : 1;  /*!< [16..16] Configuration Data Lock Bit                                      */
            __IM uint32_t CDLK49 : 1;  /*!< [17..17] Configuration Data Lock Bit                                      */
            __IM uint32_t CDLK50 : 1;  /*!< [18..18] Configuration Data Lock Bit                                      */
            __IM uint32_t CDLK51 : 1;  /*!< [19..19] Configuration Data Lock Bit                                      */
            __IM uint32_t CDLK52 : 1;  /*!< [20..20] Configuration Data Lock Bit                                      */
            __IM uint32_t CDLK53 : 1;  /*!< [21..21] Configuration Data Lock Bit                                      */
            __IM uint32_t CDLK54 : 1;  /*!< [22..22] Configuration Data Lock Bit                                      */
            __IM uint32_t CDLK55 : 1;  /*!< [23..23] Configuration Data Lock Bit                                      */
            __IM uint32_t CDLK56 : 1;  /*!< [24..24] Configuration Data Lock Bit                                      */
            __IM uint32_t CDLK57 : 1;  /*!< [25..25] Configuration Data Lock Bit                                      */
            __IM uint32_t CDLK58 : 1;  /*!< [26..26] Configuration Data Lock Bit                                      */
            __IM uint32_t CDLK59 : 1;  /*!< [27..27] Configuration Data Lock Bit                                      */
            __IM uint32_t CDLK60 : 1;  /*!< [28..28] Configuration Data Lock Bit                                      */
            __IM uint32_t CDLK61 : 1;  /*!< [29..29] Configuration Data Lock Bit                                      */
            __IM uint32_t CDLK62 : 1;  /*!< [30..30] Configuration Data Lock Bit                                      */
            __IM uint32_t CDLK63 : 1;  /*!< [31..31] Configuration Data Lock Bit                                      */
        } CFGD_H_b;
    };
} R_OFS_DATAFLASH_CFGDLOCK_CFGD_Type;  /*!< Size = 8 (0x8)                                                            */

/**
 * @brief R_OFS_DATAFLASH_CFGDLOCK [CFGDLOCK] (Configuration Data Lock Bits)
 */
typedef struct
{
    __IOM R_OFS_DATAFLASH_CFGDLOCK_CFGD_Type CFGD0; /*!< (@ 0x00000000) Configuration Data 0 Lock Bits                            */
    __IOM R_OFS_DATAFLASH_CFGDLOCK_CFGD_Type CFGD1; /*!< (@ 0x00000008) Configuration Data 1 Lock Bits                            */

    union
    {
        __IM uint16_t CFGD2;                        /*!< (@ 0x00000010) Configuration Data 2 Lock Bit                              */

