renesas/fsp/ra/fsp/src/bsp/cmsis/Device/RENESAS/Include/R7FA8E2AF.h
        struct
        {
            __IOM uint32_t MSSAR0  : 1; /*!< [0..0] Module stop security attribution bit 0                             */
            __IOM uint32_t MSSAR1  : 1; /*!< [1..1] Module stop security attribution bit 1                             */
            __IOM uint32_t MSSAR2  : 1; /*!< [2..2] Module stop security attribution bit 2                             */
            __IOM uint32_t MSSAR3  : 1; /*!< [3..3] Module stop security attribution bit 3                             */
            __IOM uint32_t MSSAR4  : 1; /*!< [4..4] Module stop security attribution bit 4                             */
            __IOM uint32_t MSSAR5  : 1; /*!< [5..5] Module stop security attribution bit 5                             */
            __IOM uint32_t MSSAR6  : 1; /*!< [6..6] Module stop security attribution bit 6                             */
            __IOM uint32_t MSSAR7  : 1; /*!< [7..7] Module stop security attribution bit 7                             */
            __IOM uint32_t MSSAR8  : 1; /*!< [8..8] Module stop security attribution bit 8                             */
            __IOM uint32_t MSSAR9  : 1; /*!< [9..9] Module stop security attribution bit 9                             */
            __IOM uint32_t MSSAR10 : 1; /*!< [10..10] Module stop security attribution bit 10                          */
            __IOM uint32_t MSSAR11 : 1; /*!< [11..11] Module stop security attribution bit 11                          */
            __IOM uint32_t MSSAR12 : 1; /*!< [12..12] Module stop security attribution bit 12                          */
            __IOM uint32_t MSSAR13 : 1; /*!< [13..13] Module stop security attribution bit 13                          */
            __IOM uint32_t MSSAR14 : 1; /*!< [14..14] Module stop security attribution bit 14                          */
            __IOM uint32_t MSSAR15 : 1; /*!< [15..15] Module stop security attribution bit 15                          */
            __IOM uint32_t MSSAR16 : 1; /*!< [16..16] Module stop security attribution bit 16                          */
            __IOM uint32_t MSSAR17 : 1; /*!< [17..17] Module stop security attribution bit 17                          */
            __IOM uint32_t MSSAR18 : 1; /*!< [18..18] Module stop security attribution bit 18                          */
            __IOM uint32_t MSSAR19 : 1; /*!< [19..19] Module stop security attribution bit 19                          */
            __IOM uint32_t MSSAR20 : 1; /*!< [20..20] Module stop security attribution bit 20                          */
            __IOM uint32_t MSSAR21 : 1; /*!< [21..21] Module stop security attribution bit 21                          */
            __IOM uint32_t MSSAR22 : 1; /*!< [22..22] Module stop security attribution bit 22                          */
            __IOM uint32_t MSSAR23 : 1; /*!< [23..23] Module stop security attribution bit 23                          */
            __IOM uint32_t MSSAR24 : 1; /*!< [24..24] Module stop security attribution bit 24                          */
            __IOM uint32_t MSSAR25 : 1; /*!< [25..25] Module stop security attribution bit 25                          */
            __IOM uint32_t MSSAR26 : 1; /*!< [26..26] Module stop security attribution bit 26                          */
            __IOM uint32_t MSSAR27 : 1; /*!< [27..27] Module stop security attribution bit 27                          */
            __IOM uint32_t MSSAR28 : 1; /*!< [28..28] Module stop security attribution bit 28                          */
            __IOM uint32_t MSSAR29 : 1; /*!< [29..29] Module stop security attribution bit 29                          */
            __IOM uint32_t MSSAR30 : 1; /*!< [30..30] Module stop security attribution bit 30                          */
            __IOM uint32_t MSSAR31 : 1; /*!< [31..31] Module stop security attribution bit 31                          */
        } MSSAR_b;
    };
    __IM uint32_t RESERVED1;

    union
    {
        __IOM uint32_t PPARB;           /*!< (@ 0x0000001C) Peripheral Privilege Attribution Register B                */

        struct
        {
            __IOM uint32_t PPARB0  : 1; /*!< [0..0] Peripheral privilege attribution bit 0                             */
            __IOM uint32_t PPARB1  : 1; /*!< [1..1] Peripheral privilege attribution bit 1                             */
            __IOM uint32_t PPARB2  : 1; /*!< [2..2] Peripheral privilege attribution bit 2                             */
            __IOM uint32_t PPARB3  : 1; /*!< [3..3] Peripheral privilege attribution bit 3                             */
            __IOM uint32_t PPARB4  : 1; /*!< [4..4] Peripheral privilege attribution bit 4                             */
            __IOM uint32_t PPARB5  : 1; /*!< [5..5] Peripheral privilege attribution bit 5                             */
            __IOM uint32_t PPARB6  : 1; /*!< [6..6] Peripheral privilege attribution bit 6                             */
            __IOM uint32_t PPARB7  : 1; /*!< [7..7] Peripheral privilege attribution bit 7                             */
            __IOM uint32_t PPARB8  : 1; /*!< [8..8] Peripheral privilege attribution bit 8                             */
            __IOM uint32_t PPARB9  : 1; /*!< [9..9] Peripheral privilege attribution bit 9                             */
            __IOM uint32_t PPARB10 : 1; /*!< [10..10] Peripheral privilege attribution bit 10                          */
            __IOM uint32_t PPARB11 : 1; /*!< [11..11] Peripheral privilege attribution bit 11                          */
            __IOM uint32_t PPARB12 : 1; /*!< [12..12] Peripheral privilege attribution bit 12                          */
            __IOM uint32_t PPARB13 : 1; /*!< [13..13] Peripheral privilege attribution bit 13                          */
            __IOM uint32_t PPARB14 : 1; /*!< [14..14] Peripheral privilege attribution bit 14                          */
            __IOM uint32_t PPARB15 : 1; /*!< [15..15] Peripheral privilege attribution bit 15                          */
            __IOM uint32_t PPARB16 : 1; /*!< [16..16] Peripheral privilege attribution bit 16                          */
            __IOM uint32_t PPARB17 : 1; /*!< [17..17] Peripheral privilege attribution bit 17                          */
            __IOM uint32_t PPARB18 : 1; /*!< [18..18] Peripheral privilege attribution bit 18                          */
            __IOM uint32_t PPARB19 : 1; /*!< [19..19] Peripheral privilege attribution bit 19                          */
            __IOM uint32_t PPARB20 : 1; /*!< [20..20] Peripheral privilege attribution bit 20                          */
            __IOM uint32_t PPARB21 : 1; /*!< [21..21] Peripheral privilege attribution bit 21                          */
            __IOM uint32_t PPARB22 : 1; /*!< [22..22] Peripheral privilege attribution bit 22                          */
            __IOM uint32_t PPARB23 : 1; /*!< [23..23] Peripheral privilege attribution bit 23                          */
            __IOM uint32_t PPARB24 : 1; /*!< [24..24] Peripheral privilege attribution bit 24                          */
            __IOM uint32_t PPARB25 : 1; /*!< [25..25] Peripheral privilege attribution bit 25                          */
            __IOM uint32_t PPARB26 : 1; /*!< [26..26] Peripheral privilege attribution bit 26                          */
            __IOM uint32_t PPARB27 : 1; /*!< [27..27] Peripheral privilege attribution bit 27                          */
            __IOM uint32_t PPARB28 : 1; /*!< [28..28] Peripheral privilege attribution bit 28                          */
            __IOM uint32_t PPARB29 : 1; /*!< [29..29] Peripheral privilege attribution bit 29                          */
            __IOM uint32_t PPARB30 : 1; /*!< [30..30] Peripheral privilege attribution bit 30                          */
            __IOM uint32_t PPARB31 : 1; /*!< [31..31] Peripheral privilege attribution bit 31                          */
        } PPARB_b;
    };

    union
    {
        __IOM uint32_t PPARC;           /*!< (@ 0x00000020) Peripheral Privilege Attribution Register C                */

        struct
        {
            __IOM uint32_t PPARC0  : 1; /*!< [0..0] Peripheral privilege attribution bit 0                             */
            __IOM uint32_t PPARC1  : 1; /*!< [1..1] Peripheral privilege attribution bit 1                             */
            __IOM uint32_t PPARC2  : 1; /*!< [2..2] Peripheral privilege attribution bit 2                             */
            __IOM uint32_t PPARC3  : 1; /*!< [3..3] Peripheral privilege attribution bit 3                             */
            __IOM uint32_t PPARC4  : 1; /*!< [4..4] Peripheral privilege attribution bit 4                             */
            __IOM uint32_t PPARC5  : 1; /*!< [5..5] Peripheral privilege attribution bit 5                             */
            __IOM uint32_t PPARC6  : 1; /*!< [6..6] Peripheral privilege attribution bit 6                             */
            __IOM uint32_t PPARC7  : 1; /*!< [7..7] Peripheral privilege attribution bit 7                             */
            __IOM uint32_t PPARC8  : 1; /*!< [8..8] Peripheral privilege attribution bit 8                             */
            __IOM uint32_t PPARC9  : 1; /*!< [9..9] Peripheral privilege attribution bit 9                             */
            __IOM uint32_t PPARC10 : 1; /*!< [10..10] Peripheral privilege attribution bit 10                          */
            __IOM uint32_t PPARC11 : 1; /*!< [11..11] Peripheral privilege attribution bit 11                          */
            __IOM uint32_t PPARC12 : 1; /*!< [12..12] Peripheral privilege attribution bit 12                          */
            __IOM uint32_t PPARC13 : 1; /*!< [13..13] Peripheral privilege attribution bit 13                          */
            __IOM uint32_t PPARC14 : 1; /*!< [14..14] Peripheral privilege attribution bit 14                          */
            __IOM uint32_t PPARC15 : 1; /*!< [15..15] Peripheral privilege attribution bit 15                          */
            __IOM uint32_t PPARC16 : 1; /*!< [16..16] Peripheral privilege attribution bit 16                          */
            __IOM uint32_t PPARC17 : 1; /*!< [17..17] Peripheral privilege attribution bit 17                          */
            __IOM uint32_t PPARC18 : 1; /*!< [18..18] Peripheral privilege attribution bit 18                          */
            __IOM uint32_t PPARC19 : 1; /*!< [19..19] Peripheral privilege attribution bit 19                          */
            __IOM uint32_t PPARC20 : 1; /*!< [20..20] Peripheral privilege attribution bit 20                          */
            __IOM uint32_t PPARC21 : 1; /*!< [21..21] Peripheral privilege attribution bit 21                          */
            __IOM uint32_t PPARC22 : 1; /*!< [22..22] Peripheral privilege attribution bit 22                          */
            __IOM uint32_t PPARC23 : 1; /*!< [23..23] Peripheral privilege attribution bit 23                          */
            __IOM uint32_t PPARC24 : 1; /*!< [24..24] Peripheral privilege attribution bit 24                          */
            __IOM uint32_t PPARC25 : 1; /*!< [25..25] Peripheral privilege attribution bit 25                          */
            __IOM uint32_t PPARC26 : 1; /*!< [26..26] Peripheral privilege attribution bit 26                          */
            __IOM uint32_t PPARC27 : 1; /*!< [27..27] Peripheral privilege attribution bit 27                          */
            __IOM uint32_t PPARC28 : 1; /*!< [28..28] Peripheral privilege attribution bit 28                          */
            __IOM uint32_t PPARC29 : 1; /*!< [29..29] Peripheral privilege attribution bit 29                          */
            __IOM uint32_t PPARC30 : 1; /*!< [30..30] Peripheral privilege attribution bit 30                          */
            __IOM uint32_t PPARC31 : 1; /*!< [31..31] Peripheral privilege attribution bit 31                          */
        } PPARC_b;
    };

    union
    {
        __IOM uint32_t PPARD;           /*!< (@ 0x00000024) Peripheral Privilege Attribution Register D                */

        struct
        {
            __IOM uint32_t PPARD0  : 1; /*!< [0..0] Peripheral privilege attribution bit 0                             */
            __IOM uint32_t PPARD1  : 1; /*!< [1..1] Peripheral privilege attribution bit 1                             */
            __IOM uint32_t PPARD2  : 1; /*!< [2..2] Peripheral privilege attribution bit 2                             */
            __IOM uint32_t PPARD3  : 1; /*!< [3..3] Peripheral privilege attribution bit 3                             */
            __IOM uint32_t PPARD4  : 1; /*!< [4..4] Peripheral privilege attribution bit 4                             */
            __IOM uint32_t PPARD5  : 1; /*!< [5..5] Peripheral privilege attribution bit 5                             */
            __IOM uint32_t PPARD6  : 1; /*!< [6..6] Peripheral privilege attribution bit 6                             */
            __IOM uint32_t PPARD7  : 1; /*!< [7..7] Peripheral privilege attribution bit 7                             */
            __IOM uint32_t PPARD8  : 1; /*!< [8..8] Peripheral privilege attribution bit 8                             */
            __IOM uint32_t PPARD9  : 1; /*!< [9..9] Peripheral privilege attribution bit 9                             */
            __IOM uint32_t PPARD10 : 1; /*!< [10..10] Peripheral privilege attribution bit 10                          */
            __IOM uint32_t PPARD11 : 1; /*!< [11..11] Peripheral privilege attribution bit 11                          */
            __IOM uint32_t PPARD12 : 1; /*!< [12..12] Peripheral privilege attribution bit 12                          */
            __IOM uint32_t PPARD13 : 1; /*!< [13..13] Peripheral privilege attribution bit 13                          */
            __IOM uint32_t PPARD14 : 1; /*!< [14..14] Peripheral privilege attribution bit 14                          */
            __IOM uint32_t PPARD15 : 1; /*!< [15..15] Peripheral privilege attribution bit 15                          */
            __IOM uint32_t PPARD16 : 1; /*!< [16..16] Peripheral privilege attribution bit 16                          */
            __IOM uint32_t PPARD17 : 1; /*!< [17..17] Peripheral privilege attribution bit 17                          */
            __IOM uint32_t PPARD18 : 1; /*!< [18..18] Peripheral privilege attribution bit 18                          */
            __IOM uint32_t PPARD19 : 1; /*!< [19..19] Peripheral privilege attribution bit 19                          */
            __IOM uint32_t PPARD20 : 1; /*!< [20..20] Peripheral privilege attribution bit 20                          */
            __IOM uint32_t PPARD21 : 1; /*!< [21..21] Peripheral privilege attribution bit 21                          */
            __IOM uint32_t PPARD22 : 1; /*!< [22..22] Peripheral privilege attribution bit 22                          */
            __IOM uint32_t PPARD23 : 1; /*!< [23..23] Peripheral privilege attribution bit 23                          */
            __IOM uint32_t PPARD24 : 1; /*!< [24..24] Peripheral privilege attribution bit 24                          */
            __IOM uint32_t PPARD25 : 1; /*!< [25..25] Peripheral privilege attribution bit 25                          */
            __IOM uint32_t PPARD26 : 1; /*!< [26..26] Peripheral privilege attribution bit 26                          */
            __IOM uint32_t PPARD27 : 1; /*!< [27..27] Peripheral privilege attribution bit 27                          */
            __IOM uint32_t PPARD28 : 1; /*!< [28..28] Peripheral privilege attribution bit 28                          */
            __IOM uint32_t PPARD29 : 1; /*!< [29..29] Peripheral privilege attribution bit 29                          */
            __IOM uint32_t PPARD30 : 1; /*!< [30..30] Peripheral privilege attribution bit 30                          */
            __IOM uint32_t PPARD31 : 1; /*!< [31..31] Peripheral privilege attribution bit 31                          */
        } PPARD_b;
    };

    union
    {
        __IOM uint32_t PPARE;           /*!< (@ 0x00000028) Peripheral Privilege Attribution Register E                */

        struct
        {
            __IOM uint32_t PPARE0  : 1; /*!< [0..0] Peripheral privilege attribution bit 0                             */
            __IOM uint32_t PPARE1  : 1; /*!< [1..1] Peripheral privilege attribution bit 1                             */
            __IOM uint32_t PPARE2  : 1; /*!< [2..2] Peripheral privilege attribution bit 2                             */
            __IOM uint32_t PPARE3  : 1; /*!< [3..3] Peripheral privilege attribution bit 3                             */
            __IOM uint32_t PPARE4  : 1; /*!< [4..4] Peripheral privilege attribution bit 4                             */
            __IOM uint32_t PPARE5  : 1; /*!< [5..5] Peripheral privilege attribution bit 5                             */
            __IOM uint32_t PPARE6  : 1; /*!< [6..6] Peripheral privilege attribution bit 6                             */
            __IOM uint32_t PPARE7  : 1; /*!< [7..7] Peripheral privilege attribution bit 7                             */
            __IOM uint32_t PPARE8  : 1; /*!< [8..8] Peripheral privilege attribution bit 8                             */
            __IOM uint32_t PPARE9  : 1; /*!< [9..9] Peripheral privilege attribution bit 9                             */
            __IOM uint32_t PPARE10 : 1; /*!< [10..10] Peripheral privilege attribution bit 10                          */
            __IOM uint32_t PPARE11 : 1; /*!< [11..11] Peripheral privilege attribution bit 11                          */
            __IOM uint32_t PPARE12 : 1; /*!< [12..12] Peripheral privilege attribution bit 12                          */
            __IOM uint32_t PPARE13 : 1; /*!< [13..13] Peripheral privilege attribution bit 13                          */
            __IOM uint32_t PPARE14 : 1; /*!< [14..14] Peripheral privilege attribution bit 14                          */
            __IOM uint32_t PPARE15 : 1; /*!< [15..15] Peripheral privilege attribution bit 15                          */
            __IOM uint32_t PPARE16 : 1; /*!< [16..16] Peripheral privilege attribution bit 16                          */
            __IOM uint32_t PPARE17 : 1; /*!< [17..17] Peripheral privilege attribution bit 17                          */
            __IOM uint32_t PPARE18 : 1; /*!< [18..18] Peripheral privilege attribution bit 18                          */
            __IOM uint32_t PPARE19 : 1; /*!< [19..19] Peripheral privilege attribution bit 19                          */
            __IOM uint32_t PPARE20 : 1; /*!< [20..20] Peripheral privilege attribution bit 20                          */
            __IOM uint32_t PPARE21 : 1; /*!< [21..21] Peripheral privilege attribution bit 21                          */
            __IOM uint32_t PPARE22 : 1; /*!< [22..22] Peripheral privilege attribution bit 22                          */
            __IOM uint32_t PPARE23 : 1; /*!< [23..23] Peripheral privilege attribution bit 23                          */
            __IOM uint32_t PPARE24 : 1; /*!< [24..24] Peripheral privilege attribution bit 24                          */
            __IOM uint32_t PPARE25 : 1; /*!< [25..25] Peripheral privilege attribution bit 25                          */
            __IOM uint32_t PPARE26 : 1; /*!< [26..26] Peripheral privilege attribution bit 26                          */
            __IOM uint32_t PPARE27 : 1; /*!< [27..27] Peripheral privilege attribution bit 27                          */
            __IOM uint32_t PPARE28 : 1; /*!< [28..28] Peripheral privilege attribution bit 28                          */
            __IOM uint32_t PPARE29 : 1; /*!< [29..29] Peripheral privilege attribution bit 29                          */
            __IOM uint32_t PPARE30 : 1; /*!< [30..30] Peripheral privilege attribution bit 30                          */
            __IOM uint32_t PPARE31 : 1; /*!< [31..31] Peripheral privilege attribution bit 31                          */
        } PPARE_b;
    };

    union
    {
        __IOM uint32_t MSPAR;           /*!< (@ 0x0000002C) Module Stop Privilege Attribution Register                 */

